import { FormattedMessage } from "react-intl";
import styles from "./policy.module.css";

export default function Policy() {
  return (
    <div className={styles.policy_container}>
      <img src="/assets/Logo.png" alt="Logo" className={styles.logo} />
      <p className={styles.title}>
        <FormattedMessage id="home.cancellationPolicy" />
      </p>
      <p className={styles.main_titles}>
        نحن في SpotX نلزم جميع الأعضاء من ملاك و مستأجرين بتطبيق سياسة الإلغاء
        على اي حجز من خلال موقعنا او تطبيق الهواتف الذكية الخاص بنا. سياسة
        الإلغاء توضح الشروط والقواعد التي تحكم العلاقة بين مالك العقار وبين
        المستأجر في حالة الغاء المستأجر للحجز الذي قام به على الوحدة وذلك للحفاظ
        على حقوق كل من المالك والمستأجر. سياسات الالغاء هي جزء من شروط الاستخدام
        العامة لموقعنا الالكتروني أو تطبيق الهواتف الذكية الخاص بنا وقيام الزائر
        بالحجز من خلال الموقع او التطبيق يعتبر موافقة ضمنية على شروط الموقع
        وسياساته وعلى سياسة الالغاء المطبقة على الوحدة التي قام الزائر بحجزها.
        باختصار إن سياسة الالغاء هي بمثابة الاتفاق القانوني الذي يوضح حقوق
        والتزامات كل طرف.
      </p>
      <p> حالات سياسة الإلغاء:</p>

      <ul className={styles.policy_content}>
        <li>
          الغاء الحجز قبل موعده ب 15 يوم على الأقل يتم رد كامل المبلغ المدفوع.
        </li>
        <li>
          الغاء الحجز قبل موعده باقل من 15 يوم و اكثر من 5 ايام يتم رد نصف
          المبلغ المدفوع.
        </li>
        <li>
          الغاء الحجز قبل موعده باقل من 5 ايام يتحمل المستأجر كامل مبلغ الحجز
          بشكل منفرد ولا يسترد منه أي مبلغ ولو بشكل جزئي.
        </li>
      </ul>
      <p>في جميع السياسات السابقة تطبق الشروط التالية:</p>
      <ul className={styles.policy_content}>
        <li>يتحمل المستأجر قيمة مصاريف تحويل النقود اليه مرة اخرى.</li>
      </ul>
      <p className={styles.main_titles}>
        قد نقوم في أي وقت بإجراء تعديلات على سياسات الموقع بدون أي إنذار مسبق
        واستمرار استخدامك للموقع هو بمثابة موافقة ضمنية على اي تغيرات تحدث في
        سياسات الموقع.
      </p>
    </div>
  );
}
